//######################################################################
//###########################           SSTech       ###################
//###########################   Programming Courses  ###################
//######################################################################
console.log('حساب المعدل');
let الرياضيات: number;
let العربية: number;
let الفرنسية: number;
let المعدل: number;
الرياضيات = parseInt(prompt('ادخل نقطة الرياضيات'));
العربية = parseInt(prompt('ادخل نقطة العربية'));
الفرنسية = parseInt(prompt('ادخل نقطة الفرنسية'));
المعدل = (الرياضيات + العربية + الفرنسية) / 3;
if (المعدل > 5) {
  console.log(المعدل);
  console.log('ناجح');
}
if (المعدل < 5) {
  console.log(المعدل);
  console.log('راسب');
}
